Repository: selahattinedin/YemekAtlas
Catalog: YemekAtlas/*.lproj/Localizable.strings
Languages: tr

source: Language
tr: Diller

source: English
tr: İngilizce

source: Turkish
tr: Türkçe

source: Preferences
tr: Tercihler

source: User Information
tr: Kullanıcı Bilgisi

source: Preferences
tr: Tercihler

source: Theme, Language, Notifications
tr: Tema, Dil, Bildirimler

source: Security
tr: Güvenlik

source: Password, Security Settings
tr: Şifre, Güvenlik Ayarları

source: Help
tr: Yardım

source: FAQ, Contact
tr: SSS, İletişim

source: About
tr: Hakkında

source: App Information
tr: Uygulama Bilgisi

source: Log Out
tr: Çıkış Yap

source: Settings
tr: Ayarlar

# log_out_confirmation
source: Are you sure you want to log out of your account?
tr: Hesabınızdan çıkmak istediğinizden emin misiniz?

source: Cancel
tr: İptal

source: Personal Information
tr: Kişisel Bilgiler

source: Full Name
tr: Tam Ad

source: Email
tr: E-posta

source: Join Date
tr: Katılım Tarihi

source: Last Login
tr: Son Giriş

source: Delete My Account
tr: Hesabımı Sil

# delete_account_alert
source: You Are About to Delete Your Account
tr: Hesabınızı Silmek Üzeresiniz

# delete_account_warning
source: This action cannot be undone. Are you sure?
tr: Bu işlem geri alınamaz. Emin misiniz?

source: Profile Information
tr: Profil Bilgileri

source: Delete
tr: Sil

source: Delete Account
tr: Hesabı Sil

source: My Favorite Recipes
tr: Favori Tariflerim

source: No Favorite Recipes Found
tr: Favori Tarif Bulunamadı

# add_to_favorites
source: You can add your favorite recipes to your favorites
tr: Favori tariflerinizi ekleyebilirsiniz

source: Delete Recipe
tr: Tarifi Sil

# do_you_want_to_delete_recipe ?
source: Do you want to delete the recipe ?
tr: Bu tarifi silmek istediğinizden emin misiniz ?

source: Recipe
tr: Tarif

source: What do you want to cook?
tr: Ne pişirmek istersiniz?

source: Ingredients
tr: Malzemeler

source: Search
tr: Ara

source: What do you want to eat today?
tr: Bugün ne pişirmek istersin?

source: Instructions
tr: Talimatlar

source: Allergens
tr: Alerjenler

source: Recipe Ingredients
tr: Tarif Malzemeleri

source: Preparation Steps
tr: Hazırlama Adımları

source: Allergen Information
tr: Alerjen Bilgisi

source: Step
tr: Adım

source: Min
tr: Dk

source: Cal
tr: Kal

source: Fat
tr: Yağ

source: Carb
tr: Karb

source: Western
tr: Batı

source: No allergens found
tr: Alerjen bulunamadı

source: %lld Min.
tr: %lld Dk.

source: %lld kcal
tr: %lld kal

source: %lld Min
tr: %lld Dak

source: Recipe Of The Day
tr: Günün Yemeği

source: Sushi
tr: Suşi

source: Tacos
tr: Tako

# flour_250g
source: 250 g flour
tr: 250 g un

# water_150ml
source: 150 ml water
tr: 150 ml su

# yeast_5g
source: 5 g yeast
tr: 5 g maya

# salt_pinch
source: A pinch of salt
tr: Bir tutam tuz

# mozzarella_200g
source: 200 g mozzarella cheese
tr: 200 g mozzarella peyniri

# tomato_sauce_100g
source: 100 g tomato sauce
tr: 100 g domates sosu

# fresh_basil
source: Fresh basil leaves
tr: Taze fesleğen yaprakları

# sushi_rice_200g
source: 200 g sushi rice
tr: 200 g suşi pirinci

# rice_vinegar_50ml
source: 50 ml rice vinegar
tr: 50 ml pirinç sirkesi

# sugar_1tsp
source: 1 teaspoon sugar
tr: 1 çay kaşığı şeker

# salt_1tsp
source: 1 teaspoon salt
tr: 1 çay kaşığı tuz

source: Nori seaweed
tr: Nori yosunu

# salmon_200g
source: 200 g salmon
tr: 200 g somon

source: Avocado slices
tr: Avokado dilimleri

# hamburger_bun
source: 1 hamburger bun
tr: 1 hamburger ekmeği

# ground_beef_150g
source: 150 g ground beef
tr: 150 g kıyma

# cheddar_slice
source: 1 slice cheddar cheese
tr: 1 dilim cheddar peyniri

# tomato_slices
source: 2 slices tomato
tr: 2 dilim domates

# lettuce_leaf
source: 1 lettuce leaf
tr: 1 yaprak marul

# condiments
source: Ketchup and mayonnaise
tr: Ketçap ve mayonez

# tortillas_2
source: 2 tortillas
tr: 2 tortilla

# chicken_breast_150g
source: 150 g chicken breast
tr: 150 g tavuk göğsü

# corn_50g
source: 50 g corn
tr: 50 g mısır

# tomato_50g
source: 50 g tomato
tr: 50 g domates

# onion_50g
source: 50 g onion
tr: 50 g soğan

# taco_seasoning_1tsp
source: 1 teaspoon taco seasoning
tr: 1 çay kaşığı tako baharatı

# rice_noodles_200g
source: 200 g rice noodles
tr: 200 g pirinç eriştesi

# shrimp_100g
source: 100 g shrimp
tr: 100 g karides

# soy_sauce_2tbsp
source: 2 tablespoons soy sauce
tr: 2 yemek kaşığı soya sosu

# fish_sauce_1tbsp
source: 1 tablespoon fish sauce
tr: 1 yemek kaşığı balık sosu

# egg_1
source: 1 egg
tr: 1 yumurta

# peanuts_50g
source: 50 g peanuts
tr: 50 g fıstık

source: Dairy
tr: Süt Ürünleri

source: Fish
tr: Balık

source: Soy
tr: Soya

source: Egg
tr: Yumurta

source: Peanuts
tr: Fıstık

# margherita_pizza_instructions
source: 1. Mix flour, water, yeast, and salt to prepare a smooth dough. 2. Let the dough rest for 30 minutes. 3. Roll out the dough and spread tomato sauce on top. 4. Add mozzarella cheese and bake at 220°C for 10-12 minutes. 5. Garnish with fresh basil leaves and serve.
tr: 1. Un, su, maya ve tuzu karıştırarak pürüzsüz bir hamur hazırlayın. 2. Hamuru 30 dakika dinlendirin. 3. Hamuru açın ve üzerine domates sosu sürün. 4. Mozzarella peyniri ekleyin ve 220°C'de 10-12 dakika pişirin. 5. Taze fesleğen yapraklarıyla süsleyip servis yapın.

# sushi_instructions
source: 1. Rinse the rice and cook it by boiling. 2. Mix rice vinegar, sugar, and salt, then add to the hot rice. 3. Spread the rice thinly over the nori seaweed. 4. Add salmon and avocado slices, then roll. 5. Slice and serve.
tr: 1. Pirinci durulayın ve kaynatarak pişirin. 2. Pirinç sirkesi, şeker ve tuzu karıştırın, ardından sıcak pirince ekleyin. 3. Pirinci nori yosununun üzerine ince bir tabaka halinde yayın. 4. Somon ve avokado dilimlerini ekleyip rulo yapın. 5. Dilimleyip servis yapın.

# hamburger_instructions
source: 1. Shape the ground beef into a patty and cook in a pan. 2. Slice the hamburger bun in half and toast it. 3. Place lettuce, tomato slices, the cooked patty, and cheddar cheese on the bottom bun. 4. Add ketchup and mayonnaise, then close with the top bun.
tr: 1. Kıymayı köfte şekline getirin ve tavada pişirin. 2. Hamburger ekmeğini ortadan ikiye kesin ve kızartın. 3. Alt ekmeğin üzerine marul, domates dilimleri, pişmiş köfte ve cheddar peynirini yerleştirin. 4. Ketçap ve mayonez ekleyip üst ekmekle kapatın.

# tacos_instructions
source: 1. Cut the chicken breast into small pieces and marinate with taco seasoning. 2. Cook the chicken in a pan. 3. Fill the tortillas with chicken, corn, tomato, and onion. 4. Add sauce if desired and serve.
tr: 1. Tavuk göğsünü küçük parçalar halinde kesin ve tako baharatıyla marine edin. 2. Tavuğu tavada pişirin. 3. Tortillaları tavuk, mısır, domates ve soğanla doldurun. 4. İsterseniz sos ekleyip servis yapın.

# pad_thai_instructions
source: 1. Boil and drain the rice noodles. 2. Scramble the egg in a pan. 3. Add shrimp, soy sauce, and fish sauce, then mix well. 4. Add the boiled noodles to the pan. 5. Sprinkle peanuts on top and serve.
tr: 1. Pirinç eriştelerini haşlayıp süzün. 2. Yumurtayı tavada çırpın. 3. Karides, soya sosu ve balık sosu ekleyip iyice karıştırın. 4. Haşlanmış erişteler tavaya ekleyin. 5. Üzerine fıstık serpin ve servis yapın.

source: Chef's Specials
tr: Şef Özel Tarifleri

source: Calories
tr: Kalori

source: Carbohydrates
tr: Karbonhidrat

source: Fat
tr: Yağ

source: Allergens
tr: Alerjenler

source: Ingredients
tr: Malzemeler

source: Instructions
tr: Hazırlanışı

source: minutes
tr: dakika

source: Recent Searches
tr: Son Aramalar

source: Clear
tr: Temizle

source: No recent searches found.
tr: Son arama bulunamadı.

source: Clear History
tr: Geçmişi Temizle

source: Are you sure you want to clear all recent searches?
tr: Tüm son aramaları temizlemek istediğinizden emin misiniz?

source: %d Min
tr: %d Dak

# search_ingredient_placeholder
source: Search ingredients
tr: Malzeme Ara

# add_ingredients_button
source: Add ingredients
tr: Malzemeleri Ekle

source: Vegetables
tr: Sebzeler

source: Fish
tr: Balık

source: Meat And Dairy
tr: Et ve Süt Ürünleri

source: Legumes
tr: Baklagiller

source: Spices
tr: Baharatlar

source: Lettuce
tr: Marul

source: Broccoli
tr: Brokoli

source: Tomato
tr: Domates

source: Cucumber
tr: Salatalık

source: Carrot
tr: Havuç

source: Zucchini
tr: Kabak

source: Red Bell Pepper
tr: Kırmızı Kapya Biber

source: Purslane
tr: Semizotu

source: Onion
tr: Soğan

source: Lemon
tr: Limon

source: Cauliflower
tr: Karnabahar

source: Green Beans
tr: Yeşil Fasulye

source: Spinach
tr: Ispanak

source: Mushrooms
tr: Mantar

source: Beef Liver
tr: Dana Ciğer

source: Cubed Meat
tr: Kuşbaşı Et

source: Ground Meat
tr: Kıyma

source: Steak
tr: Biftek

source: Chickpeas
tr: Nohut

source: Peas
tr: Bezelye

source: Rice
tr: Pirinç

source: Sausage
tr: Sosis

source: Discover tasty global cuisines
tr: Dünyanın lezzetli mutfaklarını keşfedin.

source: delete account confirmation
tr: Hesabı silmek istediğine emin misin?

source: Favorite
tr: Favoriler

# Setting
source: Settings
tr: Ayarlar

source: Get Started
tr: Başlayalım

source: Preparing for...
tr: Hazırlanıyor...

# Food Matching Title
source: Food Matching Game
tr: 🍽️ Yemek Eşleştirme

# Cuisine Title Format
source: %@ %@ Cuisine
tr: %@ %@ Mutfağı

# Select Country Title
source: Select a Country
tr: Ülke Seçin

# Select Country Subtitle
source: Choose a country to discover its cuisine
tr: Mutfağını keşfetmek için bir ülke seçin

# Generating Foods Format
source: Generating dishes from %@...
tr: %@ yemekleri oluşturuluyor...

# Error Title
source: Something went wrong
tr: Ups! Bir şeyler yanlış gitti

# Back Button
source: Back
tr: Geri

# Try Again Button
source: Try Again
tr: Tekrar Dene

# Favorite Dish Title
source: Find Your Favorite Dish!
tr: Favori Yemeğini Bul!

# Favorite Country Dish Format
source: Find Your Favorite %@ Dish!
tr: Favori %@ Yemeğini Bul!

# Intro Description
source: In each matchup, pick the dish you prefer. The winner advances to face a new challenger.
tr: Her eşleşmede, tercih ettiğiniz yemeği seçin. Kazanan, yeni bir rakiple karşılaşmak için ilerler.

# Start Button
source: Start
tr: Başla

# Which Prefer
source: Which dish do you prefer?
tr: Hangisini tercih edersiniz?

# Remaining Dishes Format
source: %d dishes remaining
tr: Kalan yemekler: %d

# AI Prompt Format
source: Generate 8 most popular traditional dishes from %@ as a JSON array. For each dish include 'name', 'descriptionEN' (description in English), and 'descriptionTR' (description in Turkish). The descriptions main ingredients. Format as JSON array only.
tr: %@ ülkesine ait en popüler 8 geleneksel yemeği JSON dizisi olarak oluşturun. Her yemek için 'name', 'descriptionEN' (İngilizce açıklama) ve 'descriptionTR' (Türkçe açıklama) bilgilerini içerin. Açıklamalar yemeğin ana malzemeleri açıklamalıdır. Sadece JSON dizisi formatında olmalıdır.

# No Dishes Generated Error
source: No dishes could be generated. Please try again.
tr: Hiç yemek oluşturulamadı. Lütfen tekrar deneyin.

# Parse Error
source: Could not parse AI response. Please try again.
tr: AI yanıtı işlenemedi. Lütfen tekrar deneyin.

# No Response Error
source: No response received from AI. Please try again.
tr: AI'dan yanıt alınamadı. Lütfen tekrar deneyin.

# API Error Format
source: Error: %@
tr: Hata: %@

# Versus
source: VS
tr: KARŞI

source: Congratulations!
tr: Tebrikler!

# Favorite Dish
source: Your favorite dish is:
tr: En sevdiğiniz yemek:

source: Play Again
tr: Tekrar Oyna

source: New Country
tr: Yeni Ülke

source: Game
tr: Oyun
